app/Controllers/Dashboard.php

    public function index()
    {
        $prodModel = new ProductModel();
        $transModel = new TransactionModel();
        $db = \Config\Database::connect();

        // Ambil Tanggal Hari Ini (Format: 2023-11-20)
        $today = date('Y-m-d');

        // Hitung data ringkas untuk dashboard
        $data = [
            'total_produk' => $prodModel->countAll(),

            'stok_tipis'   => $prodModel->where('stock <', 10)->countAllResults(),

            // FIX: Gunakan LIKE agar mencocokkan semua jam di tanggal hari ini
            'penjualan_hari_ini' => $db->table('transactions')
                                       ->like('created_at', $today, 'after')
                                       ->countAllResults(),

            // FIX: Gunakan LIKE juga untuk Omset
            'omset_hari_ini' => $db->table('transactions')
                                   ->selectSum('total_amount')
                                   ->like('created_at', $today, 'after')
                                   ->get()->getRow()->total_amount ?? 0
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `stock` < 10
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE DATE(created_at) = '2025-11-19'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `created_at` LIKE '2025-11-20%' ESCAPE '!'
SELECT SUM(`total_amount`) AS `total_amount`
FROM `transactions`
WHERE `created_at` LIKE '2025-11-20%' ESCAPE '!'