app/Controllers/Kasir.php

SELECT *
FROM `products`
---
    public function index()
    {
        $productModel = new ProductModel();

        // Ambil semua produk untuk ditampilkan di daftar
        $data['products'] = $productModel->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function add()
    {
        $productId = $this->request->getPost('product_id');
        $productModel = new ProductModel();
        $product = $productModel->find($productId);

INSERT INTO `transactions` (`invoice_no`, `total_amount`, `created_at`, `updated_at`) VALUES ('INV-20251119171106', 60000, '2025-11-19 17:11:06', '2025-11-19 17:11:06')
INSERT INTO `transaction_details` (`transaction_id`, `product_id`, `qty`, `price`) VALUES (0, '1', 3, '20000.00')
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
UPDATE `products` SET `stock` = 17
WHERE `products`.`id` IN ('1')
---
    public function checkout()
    {
        $cart = session()->get('cart');
        if (empty($cart)) return redirect()->to('/kasir');

        $db = \Config\Database::connect();
        $transModel = new TransactionModel();
        $detailModel = new TransactionDetailModel();
        $productModel = new ProductModel();

        // Gunakan Database Transaction agar aman (Semua sukses atau batal semua)
        $db->transStart();

        // A. Simpan Header Transaksi
        $grandTotal = 0;
        foreach ($cart as $item) $grandTotal += $item['price'] * $item['qty'];

        $transId = $transModel->insert([
            'invoice_no' => 'INV-' . date('YmdHis'),
            'total_amount' => $grandTotal
        ]);

        // B. Simpan Detail & Kurangi Stok
        foreach ($cart as $item) {
            $detailModel->insert([
                'transaction_id' => $transId,
                'product_id' => $item['id'],
                'qty' => $item['qty'],
                'price' => $item['price']
            ]);

            // Kurangi stok di tabel produk
            $currentProduct = $productModel->find($item['id']);
            $newStock = $currentProduct['stock'] - $item['qty'];
            $productModel->update($item['id'], ['stock' => $newStock]);