app/Controllers/Laporan.php

SELECT `products`.`name`, `products`.`category`, SUM(transaction_details.qty) as total_sold
FROM `transaction_details`
JOIN `products` ON `products`.`id` = `transaction_details`.`product_id`
GROUP BY `transaction_details`.`product_id`
ORDER BY `total_sold` DESC
 LIMIT 5
---
    public function index()
    {
        $db = \Config\Database::connect();

        // 1. Query Fast Moving (Terlaris)
        // Mengambil produk yang terjual, dijumlahkan qty-nya, diurutkan tertinggi
        $fastQuery = $db->table('transaction_details')
                        ->select('products.name, products.category, SUM(transaction_details.qty) as total_sold')
                        ->join('products', 'products.id = transaction_details.product_id')
                        ->groupBy('transaction_details.product_id')
                        ->orderBy('total_sold', 'DESC')
                        ->limit(5) // Ambil 5 teratas
                        ->get()
                        ->getResultArray();