app/Controllers/Produk.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function edit($id)
    {
        $model = new ProductModel();
        $data['product'] = $model->find($id);